#+title: In-buffer Completion Configuration
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle corfu-company.el
#+auto_tangle: y

*** Completion-at-Point Functions (CAPF)

The modern standard for Emacs completion is ~completion-at-point-functions~ (CAPF).
This is a buffer-local hook that contains functions which can provide completions
at the current point.

#+begin_src emacs-lisp :tangle no :results output
;; Inspect what completion functions are registered in the current buffer
(defun jf/show-capf ()
  "Display the current completion-at-point-functions."
  (interactive)
  (let ((funcs completion-at-point-functions))
    (princ (format "Completion-at-point-functions in %s:\n" (buffer-name)))
    (princ (format "Major mode: %s\n\n" major-mode))
    (if funcs
        (dolist (func funcs)
          (princ (format "  • %s\n" func)))
      (princ "  (none registered)\n"))
    (princ "\nTo test, position cursor and run: M-x completion-at-point")))

;; Execute this block with C-c C-c to see what's registered
(jf/show-capf)
#+end_src

#+RESULTS:
: Completion-at-point-functions in corfu-company.org:
: Major mode: org-mode
: 
:   • pcomplete-completions-at-point
:   • t
:   • ispell-completion-at-point
: 
: To test, position cursor and run: M-x completion-at-point

*** Company Backend Architecture

A Company backend is a function that responds to different commands. When Company needs
completions, it calls backends with specific command symbols.

*Key Commands:*
- ~'prefix~ - Return the text to complete, or nil if can't complete here
- ~'candidates~ - Return list of completion candidates for the prefix
- ~'meta~ - Return one-line documentation for a candidate
- ~'annotation~ - Return short annotation (type, signature, etc.)
- ~'doc-buffer~ - Return buffer with full documentation
- ~'location~ - Return (FILE . LINE) or (BUFFER . POS) for definition
- ~'post-completion~ - Called after completing, for side effects

#+begin_src emacs-lisp :tangle no :results output
(defun jf/show-company-backends ()
  "Display all registered Company backends."
  (interactive)
  (princ "=== Company Backend Configuration ===\n\n")

  (if (not (featurep 'company))
      (princ "Company is not loaded.\n")
    (let ((backends (if (boundp 'company-backends)
                        company-backends
                      nil)))
      (princ (format "Total backends: %d\n\n" (length backends)))

      (princ "Backends (in priority order):\n")
      (let ((idx 1))
        (dolist (backend backends)
          (princ (format "%2d. %s\n" idx backend))
          (setq idx (1+ idx))))

      (princ "\n")
      (princ "Notes:\n")
      (princ "  • Backends are tried in order until one returns candidates\n")
      (princ "  • A list like (backend1 backend2) creates a 'grouped' backend\n")
      (princ "  • :with keyword merges candidates from multiple backends\n")
      (princ "  • :separate keeps them separate in the popup\n"))))

;; Execute to see your current backend configuration
(jf/show-company-backends)
#+end_src

#+RESULTS:
#+begin_example
=== Company Backend Configuration ===

Total backends: 9

Backends (in priority order):
 1. company-bbdb
 2. company-semantic
 3. company-cmake
 4. company-capf
 5. company-clang
 6. company-files
 7. (company-dabbrev-code company-gtags company-etags company-keywords)
 8. company-oddmuse
 9. company-dabbrev

Notes:
  • Backends are tried in order until one returns candidates
  • A list like (backend1 backend2) creates a 'grouped' backend
  • :with keyword merges candidates from multiple backends
  • :separate keeps them separate in the popup
#+end_example

